from pandas import DataFrame

# 딕셔너리를 원소로 갖는 리스트
grade_data = [
                {'국어':98, '영어':None, '수학':88, '과학':64},
                {'국어':88, '영어':90, '수학':62, '과학':72},
                {'국어':92, '영어':70, '수학':None, '과학':None},
                {'국어':63, '영어':60, '수학':31, '과학':70},
                {'국어':120, '영어':50, '수학':None, '과학':88}
             ]


# 딕셔너리의 키가 컬럼이름으로 사용되므로, 인덱스만 지정
df = DataFrame(grade_data, index=['철수', '영희', '민철', '수현', '호영'])
print(df)
print('-'*30)

# 1. 인덱스 이름 확인
print(df.index)
print(type(df.index))
i_list = list(df.index)
print(i_list)
print('-'*30)

# 2. 컬럼 이름 확인
print(df.columns)
c_list = list(df.columns)
print(c_list)
print('-'*30)

# 3. 데이터 값 확인
print(df.values)
print('-'*30)

# 4. 전치 구하기
df_t = df.T
print(df_t)

'''
     국어    영어    수학    과학
철수   98   NaN  88.0  64.0
영희   88  90.0  62.0  72.0
민철   92  70.0   NaN   NaN
수현   63  60.0  31.0  70.0
호영  120  50.0   NaN  88.0
------------------------------
Index(['철수', '영희', '민철', '수현', '호영'], dtype='object')
<class 'pandas.core.indexes.base.Index'>
['철수', '영희', '민철', '수현', '호영']
------------------------------
Index(['국어', '영어', '수학', '과학'], dtype='object')
['국어', '영어', '수학', '과학']
------------------------------
[[ 98.  nan  88.  64.]
 [ 88.  90.  62.  72.]
 [ 92.  70.  nan  nan]
 [ 63.  60.  31.  70.]
 [120.  50.  nan  88.]]
------------------------------
      철수    영희    민철    수현     호영
국어  98.0  88.0  92.0  63.0  120.0
영어   NaN  90.0  70.0  60.0   50.0
수학  88.0  62.0   NaN  31.0    NaN
과학  64.0  72.0   NaN  70.0   88.0
'''