from pandas import DataFrame
from pandas import read_csv

# 성적표 데이터
grade_csv = read_csv("data/grade.csv", encoding='euc-kr')
print(grade_csv.head())
print(grade_csv.tail())
print('-'*30)

# 전처리
# '이름' 열을 인덱스로 사용
name = {}
for i, v in enumerate(list(grade_csv['이름'])):
    name[i] = v

grade_df = grade_csv.rename(index=name)
print(grade_df)
print('-'*30)

# '이름' 컬럼 삭제
grade_df.drop('이름', axis=1, inplace=True)
print(grade_df)
print('-'*30)

# 1. 데이터프레임의 전체 크기를 튜플로 조회
print(grade_df.shape)
print('-'*30)

'''
    이름     국어    영어    수학    과학
0  학생1   98.0   NaN  88.0  64.0
1  학생2   88.0  90.0  62.0  72.0
2  학생3   92.0  70.0   NaN   NaN
3  학생4   63.0  60.0  31.0  70.0
4  학생5  100.0  50.0   NaN  88.0
           이름    국어    영어    수학    과학
9995   학생9996  63.0  60.0  55.0  70.0
9996   학생9997  21.0  50.0  55.0  88.0
9997   학생9998  98.0  90.0  88.0  64.0
9998   학생9999  88.0  90.0  62.0  72.0
9999  학생10000  92.0  70.0  75.0  85.0
------------------------------
              이름     국어    영어    수학    과학
학생1          학생1   98.0   NaN  88.0  64.0
학생2          학생2   88.0  90.0  62.0  72.0
학생3          학생3   92.0  70.0   NaN   NaN
학생4          학생4   63.0  60.0  31.0  70.0
학생5          학생5  100.0  50.0   NaN  88.0
         ...    ...   ...   ...   ...
학생9996    학생9996   63.0  60.0  55.0  70.0
학생9997    학생9997   21.0  50.0  55.0  88.0
학생9998    학생9998   98.0  90.0  88.0  64.0
학생9999    학생9999   88.0  90.0  62.0  72.0
학생10000  학생10000   92.0  70.0  75.0  85.0

[10000 rows x 5 columns]
------------------------------
            국어    영어    수학    과학
학생1       98.0   NaN  88.0  64.0
학생2       88.0  90.0  62.0  72.0
학생3       92.0  70.0   NaN   NaN
학생4       63.0  60.0  31.0  70.0
학생5      100.0  50.0   NaN  88.0
       ...   ...   ...   ...
학생9996    63.0  60.0  55.0  70.0
학생9997    21.0  50.0  55.0  88.0
학생9998    98.0  90.0  88.0  64.0
학생9999    88.0  90.0  62.0  72.0
학생10000   92.0  70.0  75.0  85.0

[10000 rows x 4 columns]
------------------------------
(10000, 4)
------------------------------
'''

